In [3]:
import pandas as pd
import numpy as np
S1=pd.Series()
S1#a null series

Series([], dtype: float64)

In [4]:
S2=pd.Series([1,3,5,7,9],\
            index=['a','b','c','d','e'])
S2,S2.values,S2.index

(a    1
 b    3
 c    5
 d    7
 e    9
 dtype: int64,
 array([1, 3, 5, 7, 9]),
 Index(['a', 'b', 'c', 'd', 'e'], dtype='object'))

In [5]:
pd.Series({'a':1,'b':2,'c':3})

a    1
b    2
c    3
dtype: int64

In [6]:
pd.Series([1,2,3,4,5])#using default index

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
np.random.seed(54321)#random seed
pd.Series(np.random.randn(5)),pd.Series(np.arange(2,6))

(0    0.223979
 1    0.744591
 2   -0.334269
 3    1.389172
 4   -2.296095
 dtype: float64, 0    2
 1    3
 2    4
 3    5
 dtype: int64)

In [8]:
S4=pd.Series([0,np.NaN,2,4,6,8,\
            True, 10,12])
S4.head(),S4.tail(6),S4.take([2,4,0])

(0      0
 1    NaN
 2      2
 3      4
 4      6
 dtype: object, 3       4
 4       6
 5       8
 6    True
 7      10
 8      12
 dtype: object, 2    2
 4    6
 0    0
 dtype: object)

In [9]:
S5=pd.Series([1,3,5,7,9],\
            index=['a','b','c','d','e'])
S5[2],S2['d'],S2[['a','c']]

(5, 7, a    1
 c    5
 dtype: int64)

In [10]:
#slice by indexes, including end point
#slice by locations, not including end point 
S5['a':'e'],S5[0:4]

(a    1
 b    3
 c    5
 d    7
 e    9
 dtype: int64, a    1
 b    3
 c    5
 d    7
 dtype: int64)

In [11]:
#Time series are special series with indexes being timestamp
from datetime import datetime
import pandas as pd
date=datetime(2016,1,1)
date=pd.Timestamp(date)
ts=pd.Series(1,index=[date])
#complicated because the function datestamp can not be used by groups

In [12]:
dates=['2016-01-01','2016-01-02','2016-01-03']
ts=pd.Series([1,2,3],index=pd.to_datetime(dates))
#fix the problem above

In [13]:
#Time series are just special series, nothing difficult
ts['01/01/2016'],ts['20160101'],ts['2016-01-01']

(1, 1, 1)

In [14]:
ts['2016'],ts['2016-01':'2016-02']

(2016-01-01    1
 2016-01-02    2
 2016-01-03    3
 dtype: int64, 2016-01-01    1
 2016-01-02    2
 2016-01-03    3
 dtype: int64)

In [15]:
ts.truncate(after='2016-01-02'),ts.truncate(before='2016-01-02')

(2016-01-01    1
 2016-01-02    2
 dtype: int64, 2016-01-02    2
 2016-01-03    3
 dtype: int64)

In [16]:
ts.shift(1),ts.shift(-1)

(2016-01-01    NaN
 2016-01-02    1.0
 2016-01-03    2.0
 dtype: float64, 2016-01-01    2.0
 2016-01-02    3.0
 2016-01-03    NaN
 dtype: float64)

In [17]:
#Example: compute returns
price=pd.Series([20.34,20.56,21.01,20.65,21.34],\
               index=pd.to_datetime(['2016-01-01','2016-01-02',\
                                    '2016-01-03','2016-01-04',\
                                    '2016-01-05']))
(price-price.shift(1))/price.shift(1)

2016-01-01         NaN
2016-01-02    0.010816
2016-01-03    0.021887
2016-01-04   -0.017135
2016-01-05    0.033414
dtype: float64

In [18]:
#transition between high-frequency data and low-frequency data
ts.index.freq is None

True

In [19]:
rts=ts.resample('MS',how=None)
#'M' indicates the last day of a month
#'MS' indicates the first day of a month
rts

DatetimeIndexResampler [freq=<MonthBegin>, axis=0, closed=left, label=left, convention=start, base=0]

In [20]:
#DataFrame is a set of series which share the same indexes
dates=['2016-01-01','2016-01-02','2016-01-03','2016-01-04','2016-01-05','2016-01-06']
dates=pd.to_datetime(dates)
df=pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))
df

                   A         B         C         D
2016-01-01  1.141205  0.055448 -0.082760 -0.651688
2016-01-02 -0.016022 -0.574465  0.048143  0.499497
2016-01-03  0.155397  0.762543  0.560489  0.332483
2016-01-04 -0.545423  0.592000 -0.565781 -0.120315
2016-01-05  0.429711 -0.553929  0.305712  0.219993
2016-01-06  0.992988  0.720928  0.338761 -0.482821

In [21]:
#pd.read_table('data_file',sep='\t',header=None,names=None)#csv or txt files are fine
#pd.read_csv('filepath/test.csv',header=None,sep=',')

In [22]:
df.head(),\
df.tail(6),\
df.columns,\
df.index,\
df.values,\
df.describe()

(                   A         B         C         D
 2016-01-01  1.141205  0.055448 -0.082760 -0.651688
 2016-01-02 -0.016022 -0.574465  0.048143  0.499497
 2016-01-03  0.155397  0.762543  0.560489  0.332483
 2016-01-04 -0.545423  0.592000 -0.565781 -0.120315
 2016-01-05  0.429711 -0.553929  0.305712  0.219993,
                    A         B         C         D
 2016-01-01  1.141205  0.055448 -0.082760 -0.651688
 2016-01-02 -0.016022 -0.574465  0.048143  0.499497
 2016-01-03  0.155397  0.762543  0.560489  0.332483
 2016-01-04 -0.545423  0.592000 -0.565781 -0.120315
 2016-01-05  0.429711 -0.553929  0.305712  0.219993
 2016-01-06  0.992988  0.720928  0.338761 -0.482821,
 Index(['A', 'B', 'C', 'D'], dtype='object'),
 DatetimeIndex(['2016-01-01', '2016-01-02', '2016-01-03', '2016-01-04',
                '2016-01-05', '2016-01-06'],
               dtype='datetime64[ns]', freq=None),
 array([[ 1.14120478,  0.05544775, -0.08276013, -0.65168766],
        [-0.01602191, -0.57446469,  0.04814256,  0.49949734],
        [ 0.15539682,  0.76254251,  0.56048876,  0.33248345],
        [-0.54542288,  0.5920001 , -0.5657811 , -0.12031526],
        [ 0.42971137, -0.55392888,  0.30571161,  0.21999276],
        [ 0.99298786,  0.7209282 ,  0.33876055, -0.48282117]]),
               A         B         C         D
 count  6.000000  6.000000  6.000000  6.000000
 mean   0.359643  0.167087  0.100760 -0.033808
 std    0.635430  0.620336  0.397675  0.463437
 min   -0.545423 -0.574465 -0.565781 -0.651688
 25%    0.026833 -0.401585 -0.050034 -0.392195
 50%    0.292554  0.323724  0.176927  0.049839
 75%    0.852169  0.688696  0.330498  0.304361
 max    1.141205  0.762543  0.560489  0.499497)

In [23]:
#indexing and slicing of DataFrame type datas
df[1:3],df['A'],df[['A','C']],df[df['A']>0]

(                   A         B         C         D
 2016-01-02 -0.016022 -0.574465  0.048143  0.499497
 2016-01-03  0.155397  0.762543  0.560489  0.332483, 2016-01-01    1.141205
 2016-01-02   -0.016022
 2016-01-03    0.155397
 2016-01-04   -0.545423
 2016-01-05    0.429711
 2016-01-06    0.992988
 Name: A, dtype: float64,                    A         C
 2016-01-01  1.141205 -0.082760
 2016-01-02 -0.016022  0.048143
 2016-01-03  0.155397  0.560489
 2016-01-04 -0.545423 -0.565781
 2016-01-05  0.429711  0.305712
 2016-01-06  0.992988  0.338761,                    A         B         C         D
 2016-01-01  1.141205  0.055448 -0.082760 -0.651688
 2016-01-03  0.155397  0.762543  0.560489  0.332483
 2016-01-05  0.429711 -0.553929  0.305712  0.219993
 2016-01-06  0.992988  0.720928  0.338761 -0.482821)

In [24]:
#indexing and slicing of indexes
df.loc[dates[0:2],'A':'C']#df.loc[:,'A':'C']

                   A         B         C
2016-01-01  1.141205  0.055448 -0.082760
2016-01-02 -0.016022 -0.574465  0.048143

In [25]:
#indexing and slicing of locations
df.iloc[1:4,1:4]

                   B         C         D
2016-01-02 -0.574465  0.048143  0.499497
2016-01-03  0.762543  0.560489  0.332483
2016-01-04  0.592000 -0.565781 -0.120315

In [26]:
#mixed (generalized) method of indexing and slicing 
df.ix[1:3,'A':'C']

/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

                   A         B         C
2016-01-02 -0.016022 -0.574465  0.048143
2016-01-03  0.155397  0.762543  0.560489

In [27]:
df.T#transpose

   2016-01-01  2016-01-02  2016-01-03  2016-01-04  2016-01-05  2016-01-06
A    1.141205   -0.016022    0.155397   -0.545423    0.429711    0.992988
B    0.055448   -0.574465    0.762543    0.592000   -0.553929    0.720928
C   -0.082760    0.048143    0.560489   -0.565781    0.305712    0.338761
D   -0.651688    0.499497    0.332483   -0.120315    0.219993   -0.482821

In [28]:
df.sort_values(by='A',ascending=False)

                   A         B         C         D
2016-01-01  1.141205  0.055448 -0.082760 -0.651688
2016-01-06  0.992988  0.720928  0.338761 -0.482821
2016-01-05  0.429711 -0.553929  0.305712  0.219993
2016-01-03  0.155397  0.762543  0.560489  0.332483
2016-01-02 -0.016022 -0.574465  0.048143  0.499497
2016-01-04 -0.545423  0.592000 -0.565781 -0.120315

In [29]:
df.rank(axis=0)

              A    B    C    D
2016-01-01  6.0  3.0  2.0  1.0
2016-01-02  2.0  1.0  3.0  6.0
2016-01-03  3.0  6.0  6.0  5.0
2016-01-04  1.0  4.0  1.0  3.0
2016-01-05  4.0  2.0  4.0  4.0
2016-01-06  5.0  5.0  5.0  2.0

In [31]:
df.rank(axis=1,ascending=False)

              A    B    C    D
2016-01-01  1.0  2.0  3.0  4.0
2016-01-02  3.0  4.0  2.0  1.0
2016-01-03  4.0  1.0  2.0  3.0
2016-01-04  3.0  1.0  4.0  2.0
2016-01-05  1.0  4.0  2.0  3.0
2016-01-06  1.0  2.0  3.0  4.0

In [41]:
s1=pd.Series([1,2,3,4,5,6],index=pd.date_range('20160102',periods=6))
df['E']=s1
df

                   A         B         C         D    E
2016-01-01  1.141205  0.055448 -0.082760 -0.651688  NaN
2016-01-02 -0.016022 -0.574465  0.048143  0.499497  1.0
2016-01-03  0.155397  0.762543  0.560489  0.332483  2.0
2016-01-04 -0.545423  0.592000 -0.565781 -0.120315  3.0
2016-01-05  0.429711 -0.553929  0.305712  0.219993  4.0
2016-01-06  0.992988  0.720928  0.338761 -0.482821  5.0

In [43]:
df=df[list('ABCD')]
pd.concat([df,s1],axis=1)

                   A         B         C         D    0
2016-01-01  1.141205  0.055448 -0.082760 -0.651688  NaN
2016-01-02 -0.016022 -0.574465  0.048143  0.499497  1.0
2016-01-03  0.155397  0.762543  0.560489  0.332483  2.0
2016-01-04 -0.545423  0.592000 -0.565781 -0.120315  3.0
2016-01-05  0.429711 -0.553929  0.305712  0.219993  4.0
2016-01-06  0.992988  0.720928  0.338761 -0.482821  5.0
2016-01-07       NaN       NaN       NaN       NaN  6.0

In [46]:
df1=pd.DataFrame({'A':[1,2,3],'B':[4,5,6],'C':[7,8,9]},\
                index=pd.date_range('20160110',periods=3))
df.append(df1)

/anaconda3/lib/python3.6/site-packages/pandas/core/frame.py:6211: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort)

                   A         B         C         D
2016-01-01  1.141205  0.055448 -0.082760 -0.651688
2016-01-02 -0.016022 -0.574465  0.048143  0.499497
2016-01-03  0.155397  0.762543  0.560489  0.332483
2016-01-04 -0.545423  0.592000 -0.565781 -0.120315
2016-01-05  0.429711 -0.553929  0.305712  0.219993
2016-01-06  0.992988  0.720928  0.338761 -0.482821
2016-01-10  1.000000  4.000000  7.000000       NaN
2016-01-11  2.000000  5.000000  8.000000       NaN
2016-01-12  3.000000  6.000000  9.000000       NaN

In [47]:
pd.concat([df,df1],join='inner')

                   A         B         C
2016-01-01  1.141205  0.055448 -0.082760
2016-01-02 -0.016022 -0.574465  0.048143
2016-01-03  0.155397  0.762543  0.560489
2016-01-04 -0.545423  0.592000 -0.565781
2016-01-05  0.429711 -0.553929  0.305712
2016-01-06  0.992988  0.720928  0.338761
2016-01-10  1.000000  4.000000  7.000000
2016-01-11  2.000000  5.000000  8.000000
2016-01-12  3.000000  6.000000  9.000000

In [51]:
df.drop('A',axis=1)

                   B         C         D
2016-01-01  0.055448 -0.082760 -0.651688
2016-01-02 -0.574465  0.048143  0.499497
2016-01-03  0.762543  0.560489  0.332483
2016-01-04  0.592000 -0.565781 -0.120315
2016-01-05 -0.553929  0.305712  0.219993
2016-01-06  0.720928  0.338761 -0.482821

In [62]:
df.loc[dates[2],'C']=0
df.iloc[2,2]=0
df.loc[:,'B']=np.arange(0,len(df))
df

            B         C         D
2016-01-01  0 -0.082760 -0.651688
2016-01-02  1  0.048143  0.499497
2016-01-03  2  0.000000  0.000000
2016-01-04  3 -0.565781 -0.120315
2016-01-05  4  0.305712  0.219993
2016-01-06  5  0.338761 -0.482821

In [64]:
new_index=pd.date_range('20160102',periods=7)
df.reindex(new_index,columns=list('ABCD'))

             A    B         C         D
2016-01-02 NaN  1.0  0.048143  0.499497
2016-01-03 NaN  2.0  0.000000  0.000000
2016-01-04 NaN  3.0 -0.565781 -0.120315
2016-01-05 NaN  4.0  0.305712  0.219993
2016-01-06 NaN  5.0  0.338761 -0.482821
2016-01-07 NaN  NaN       NaN       NaN
2016-01-08 NaN  NaN       NaN       NaN

In [66]:
#Operaions between series
import numpy as np
s1=pd.Series([1,2,3],index=list('ABC'))
s2=pd.Series([4,5,6],index=list('BCD'))
s1+s2

A    NaN
B    6.0
C    8.0
D    NaN
dtype: float64

In [70]:
#Operaions between series and dataframe
df1=pd.DataFrame(np.arange(1,13).reshape(3,4),index=list('abc'),columns=list('ABCD'))
df1-s1
#rows of series do operations with columns of dataframes

     A    B    C   D
a  0.0  0.0  0.0 NaN
b  4.0  4.0  4.0 NaN
c  8.0  8.0  8.0 NaN

In [71]:
#Operaions between dataframes
df2=pd.DataFrame(np.arange(1,13).reshape(4,3),index=list('bcde'),columns=list('CDE'))
df1*df2

    A   B     C     D   E
a NaN NaN   NaN   NaN NaN
b NaN NaN   7.0  16.0 NaN
c NaN NaN  44.0  60.0 NaN
d NaN NaN   NaN   NaN NaN
e NaN NaN   NaN   NaN NaN

In [72]:
df1.div=(df2,fill_value=0)

SyntaxError: invalid syntax (<ipython-input-72-31daf046289f>, line 1)

In [79]:
#applicaitons of functions
df0=pd.DataFrame(np.random.rand(6,4),index=pd.date_range('20160101',periods=6)\
                 ,columns=list('ABCD'))
df0

                   A         B         C         D
2016-01-01  0.801079  0.604863  0.846041  0.759775
2016-01-02  0.623491  0.303545  0.127736  0.727033
2016-01-03  0.761920  0.667198  0.197039  0.849407
2016-01-04  0.794461  0.863988  0.336870  0.199357
2016-01-05  0.771585  0.808307  0.134452  0.717724
2016-01-06  0.914166  0.090763  0.177726  0.879487

In [80]:
df0.apply(max,axis=0)

A    0.914166
B    0.863988
C    0.846041
D    0.879487
dtype: float64

In [81]:
f=lambda x:x.max()-x.min()
df0.apply(f,axis=1)

2016-01-01    0.241178
2016-01-02    0.599297
2016-01-03    0.652369
2016-01-04    0.664631
2016-01-05    0.673854
2016-01-06    0.823402
Freq: D, dtype: float64

In [85]:
#how to deal with missing elements?
df3=df1.mul(df2,fill_value=0)
df3

     A    B     C     D    E
a  0.0  0.0   0.0   0.0  NaN
b  0.0  0.0   7.0  16.0  0.0
c  0.0  0.0  44.0  60.0  0.0
d  NaN  NaN   0.0   0.0  0.0
e  NaN  NaN   0.0   0.0  0.0

In [88]:
#judgement of missing values
df3.isnull(),df3.notnull(),df3.B[df3.B.notnull()]

(       A      B      C      D      E
 a  False  False  False  False   True
 b  False  False  False  False  False
 c  False  False  False  False  False
 d   True   True  False  False  False
 e   True   True  False  False  False,        A      B     C     D      E
 a   True   True  True  True  False
 b   True   True  True  True   True
 c   True   True  True  True   True
 d  False  False  True  True   True
 e  False  False  True  True   True, a    0.0
 b    0.0
 c    0.0
 Name: B, dtype: float64)

In [94]:
#filling of missing values
df4=pd.DataFrame(np.random.rand(5,4),index=list('abcde')\
                 ,columns=list('ABCD'))
df4.ix['c','A']=np.nan
df4.ix['b':'d','C']=np.nan
df4.fillna(0),df4.fillna(method='ffill',axis=1),df4.fillna(method='bfill')\
,df4.fillna(method='pad',limit=2)

/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:3: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  This is separate from the ipykernel package so we can avoid doing imports until
/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:4: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  after removing the cwd from sys.path.

(          A         B         C         D
 a  0.172969  0.224252  0.163661  0.950379
 b  0.564094  0.287513  0.000000  0.111205
 c  0.000000  0.648325  0.000000  0.442967
 d  0.875092  0.059893  0.000000  0.140812
 e  0.483269  0.439106  0.395731  0.876286,
           A         B         C         D
 a  0.172969  0.224252  0.163661  0.950379
 b  0.564094  0.287513  0.287513  0.111205
 c       NaN  0.648325  0.648325  0.442967
 d  0.875092  0.059893  0.059893  0.140812
 e  0.483269  0.439106  0.395731  0.876286,
           A         B         C         D
 a  0.172969  0.224252  0.163661  0.950379
 b  0.564094  0.287513  0.395731  0.111205
 c  0.875092  0.648325  0.395731  0.442967
 d  0.875092  0.059893  0.395731  0.140812
 e  0.483269  0.439106  0.395731  0.876286,
           A         B         C         D
 a  0.172969  0.224252  0.163661  0.950379
 b  0.564094  0.287513  0.163661  0.111205
 c  0.564094  0.648325  0.163661  0.442967
 d  0.875092  0.059893       NaN  0.140812
 e  0.483269  0.439106  0.395731  0.876286)

In [98]:
#deletion of missing values
df4.dropna(axis=0),df4.dropna(axis=1,thresh=3)

(          A         B         C         D
 a  0.172969  0.224252  0.163661  0.950379
 e  0.483269  0.439106  0.395731  0.876286,           A         B         D
 a  0.172969  0.224252  0.950379
 b  0.564094  0.287513  0.111205
 c       NaN  0.648325  0.442967
 d  0.875092  0.059893  0.140812
 e  0.483269  0.439106  0.876286)

In [102]:
#deletion of repeating data
df5=pd.DataFrame({'c1':['apple']*3+['banana']*3+['apple'],\
              'c2':['a','a',3,3,'b','b','a']})
df5.duplicated()

0    False
1     True
2    False
3    False
4    False
5     True
6     True
dtype: bool

In [105]:
df5.drop_duplicates()

       c1 c2
0   apple  a
2   apple  3
3  banana  3
4  banana  b

In [106]:
df5.duplicated(['c2'])
df5.drop_duplicates(['c2'])

       c1 c2
0   apple  a
2   apple  3
4  banana  b